content/recipe/beef-shish-kebabs-for-freezer-cooking.md
---
title: "Beef Shish Kebabs for Freezer Cooking"
author: ["Trev"]
date: 2022-03-22T00:00:00-07:00
tags: ["GF"]
categories: ["entree"]
draft: false
servings: 12
prep-time: 20
cook-time: 10
ready-in: 30
source-url: "https://www.allrecipes.com/recipe/218480/beef-shish-kebabs-for-freezer-cooking/"
---

## Ingredients {#ingredients}

-   1 zucchini, cut into chunks
-   1 red bell pepper, cut into 1 inch pieces
-   1 (15 ounce) can pineapple chunks, drained
-   2 tablespoons olive oil
-   ½ cup ketchup
-   1 teaspoon salt
-   2 tablespoons [steak sauce]({{< relref "steak-sauce" >}})
-   2 tablespoons white sugar
-   2 tablespoons apple cider vinegar
-   2 tablespoons [Worcestershire sauce]({{< relref "worchestershire-sauce" >}})
-   ¼ cup water
-   1 ½ pounds beef sirloin, cut into 1 inch cubes
-   12 bamboo skewers


## Directions {#directions}

1.  Place the zucchini, bell pepper, and pineapple in a mixing bowl. Drizzle with olive oil, and toss to coat. Divide the mixture into freezer bags. Whisk the ketchup, salt, steak sauce, sugar, vinegar, Worcestershire sauce, and water together in the same bowl until smooth. Add the beef cubes, and toss until evenly coated. Divide the beef into freezer bags. Seal, and freeze the bags.
2.  To cook: take as many bags as you need from the freezer, and thaw in the refrigerator overnight, or at least 8 hours. Soak the skewers in warm water at least 30 minutes, or place into water when you begin thawing the meat and vegetable packets.
3.  Preheat an outdoor grill for medium heat, and lightly oil the grate. Make the skewers by alternating beef, vegetables, and pineapple on the skewers. Discard any remaining marinade.
4.  Cook the skewers on the preheated grill, turning occasionally until cooked to your desired degree of doneness, about 10 minutes total for medium-rare.